Repository: Lakr233/myyearwithgit
Catalog: MyYearWithGit/App/Localizable.xcstrings
Source language: zh_hans
Languages: en

source: **制作名单** 此项目由 [标准件厂长@砍砍](https://twitter.com/Lakr233) 发起，设计，并完成撰写。 与此同时，感谢 [Cyandev](https://twitter.com/unixzii) [拾一](https://twitter.com/__oquery) [82Flex](https://twitter.com/82flex) 与我一同前行。排名不分先后。 **软件许可证** 此项目使用了 [Octokit](https://github.com/nerdishbynature/octokit.swift) 与 [RequestKit](https://github.com/nerdishbynature/RequestKit.git) 来处理 GitHub 相关 Api，请参考他们的使用许可。 此项目使用了来自 [Git](https://git-scm.com/downloads/logos) [GitHub](https://github.com/logos) [GitLab](https://about.gitlab.com/press/press-kit/) [Bitbucket](https://Bitbucket.org/) 的相关图标，请参考他们的使用许可。 2021 冬，最后更新于 2024 年。
en: **Made by List** This project was initiated, designed, and written by [@Lakr233](https://twitter.com/Lakr233). At the same time, thanks to [Cyandev](https://twitter.com/unixzii), [拾一](https://twitter.com/__oquery), and [82Flex](https://twitter.com/82flex) for working with me. The ranking is in no particular order. **Software Licenses** This project uses [Octokit](https://github.com/nerdishbynature/octokit.swift) and [RequestKit](https://github.com/nerdishbynature/RequestKit.git) to handle GitHub-related APIs. Please refer to their respective licenses for use. This project uses related icons from [Git](https://git-scm.com/downloads/logos), [GitHub](https://github.com/logos), [GitLab](https://about.gitlab.com/press/press-kit/), and [Bitbucket](https://Bitbucket.org/). Please refer to their respective licenses for use. Winter 2021, last updated in 2024.

source: %@ 行
en: %@ Line(s)

source: %@ 年
en: %@ Year

# %@ 年 x %@
source: %1$@ 年 x %2$@
en: %1$@ x %2$@

source: %@ 是我今年的代言词。
en: %@ tagged my year.

source: %@的年度代码报告
en: %@’s Annually Code Report

# %lld 月 %lld 日
source: %1$lld 月 %2$lld 日
en: %1$lld @ %2$lld th

source: © %lld 标准件厂长@砍砍 & 他的朋友们
en: Copyright © %lld @Lakr233's Team. All Rights Reserved.

source: ↓ 向下滑动开启报告 ↓
en: ↓ Open My Git Letter ↓

source: Bufeature 制造机
en: Bufeature Maker

source: git 似乎没有安装，程序可能不工作。
en: It looks like git was not installed, this program may not work.

source: 上串下跳的提交，是开心，是愉悦，还是害怕，或者担心呢？
en: The erratic commits — are they driven by joy, pleasure, fear, or perhaps worry?

source: 下午
en: Afternoon

source: 个人访问令牌
en: Personal Access Token

source: 中午
en: Noon

source: 人们说色即是空，空即是色。
en: Form is emptiness, and emptiness is form.

source: 今年，我获得了不少成就。下面是我愿意和你分享的一些。
en: This year, I achieved quite a few things. Here are some I’d like to share with you.

source: 今年有一天的提交次数超过五十次
en: Having a day committed over 50 times.

source: 今年有一天的提交次数超过百次
en: Having a day committed over 100 times.

source: 今年有且只有一次提交
en: Being Single

source: 今年没有写代码
en: Never Code This Year

source: 今年的提交中熟练使用了超过六种语言
en: More then 6 language was used this year.

# 仓库因你增添了 %@ 行代码，也减去了 %@ 行的重量。
source: 仓库因你增添了 %1$@ 行代码，也减去了 %2$@ 行的重量。
en: Repository added %1$@ line(s) of code made by your hand, while removed %2$@ line(s), also made by your hand.

source: 他们也陪我走过一段旅程。
en: They have also accompanied me on a journey.

source: 他们说多少不重要，因为我的提交，每一次都心意满满。😮
en: They say the number doesn’t matter, because each of my commits is filled with intention. 😮

source: 他是我最好的伙伴。
en: He is my best partner.

source: 代码里，这些词经常出现
en: In your code, by your mind. These words are frequent.

source: 以获取 App 专用密码。
en: to obtain the App-specific password.

source: 以获取个人访问令牌。
en: to obtain a personal access token.

source: 休养生息
en: Taking Break

source: 你可添加本地或远端的仓库，不用担心仓库重复，相同的提交哈希仅计算一次。 远端仓库在分析时会被载入本地临时文件夹内，分析完成以后会从本地删除。 你可能需要额外的步骤来获取远端仓库的访问令牌，登录时会自动添加邮件地址。 克隆仅支持使用 HTTPS 协议。
en: You can add local or remote repositories without worrying about duplication. The same commit hash will only be counted once. Remote repositories will be loaded into a local temporary folder during analysis and will be deleted locally after the analysis is complete. You may need additional steps to obtain an access token for remote repositories. Your email address will be automatically added during login. Cloning only supports the HTTPS protocol. ￼

source: 你看到了吗，这一页，有 1010 行空行呢。
en: Did you see this? This page has 1010 blank lines.

source: 修得的福报，是我一生最大的欢喜。
en: The good karma I’ve earned is the greatest joy of my life.

source: 偷得浮生半日闲，可不能再修福报啦！
en: Having a half of the day off keyboard, no more coding!

source: 共 %lld 个仓库
en: %lld repository in total

source: 关闭
en: Close

source: 关闭窗口将不会保存你的分析记录。
en: Close this window will delete your analysis record.

source: 凌晨
en: Early Morning

source: 分析过程中不可载入数据，请稍后再试。
en: Data can not be loaded while in analysis.

source: 删除
en: Delete

source: 删除关键词
en: Delete the keyword.

source: 删除包含 <关键词> 的仓库，区分大小写。
en: Delete repositories containing the <Keyword>, case-sensitive.

source: 勤劳努力
en: Some Hardworking

source: 卷卷卷卷卷卷
en: Haaarrrddd Wooorrrkkk

source: 发奋图强
en: Hard Work

source: 取消
en: Cancel

source: 可能敲代码，正是我的乐趣吧。
en: Writing code might just be my source of joy.

source: 喜欢在下午茶时间提交代码
en: Likes to submit code during afternoon tea time

source: 喜欢在中午提交代码
en: Likes to submit code during the noon

source: 喜欢在午夜时分提交代码
en: Likes to submit code during the early morning

source: 喜欢在早晨提交代码
en: Likes to submit code during the morning

source: 喜欢在晚上提交代码
en: Likes to submit code during the evening

source: 喜欢在晚饭时间提交代码
en: Likes to submit code during dinner time

source: 回过头来看看这一年，似乎付出了不少。咱一共活跃了 %@ 天。
en: Looking back on this year, it seems quite a lot of effort was put in. We were active for %@ days.

source: 回过头来看看这一年，咱一共活跃了 %@ 天。
en: Looking back on this year, we were active for %@ days.

source: 在 %@ 年
en: In the year %@

source: 在代码或者提交备注中使用了不少的脏话
en: A fair amount of profanity was used in the code or commit messages.

source: 在代码或者提交备注中使用的最多的词语是脏话
en: The most frequently used word in code or commit messages is profanity.

source: 在剩余的时光里，
en: In the remaining time,

source: 在这一年里，我使用这门语言提交了 %@ 行代码。
en: In this year, I have submitted %@ lines of code using this language.

source: 在这短短的一天里，你一共提交了 %@ 次代码。
en: In just this short day, you have made %@ commits.

source: 在这里输入表达式
en: Enter expression here.

source: 地址
en: Address

source: 夜猫子
en: Night Owl

source: 大概是很特别的一天。
en: Looks like a special day.

source: 天啦噜！我的摸鱼流量超过了 100TB 呢！
en: Oh my goodness! My “slacking off” bandwidth has exceeded 100TB!

source: 天才第一步
en: First Step

source: 如果不计算周末的日子，则是 %@ 次。
en: If weekends are not counted, it will be %@ times.

source: 如果说代码是有温度的字符，那仓库便是咱的小太阳～ 🤫
en: If code is made up of characters with warmth, then the repository is our little sun~ 🤫

source: 完成
en: Done

source: 导出分析数据
en: Export Analysis Data

source: 小试牛刀
en: Try My Best

source: 干饭人！干饭魂！
en: Lets Have Launch First

source: 平均而言，我一天提交代码 %@ 次。
en: On average, %@ commit(s) was made over day to day.

source: 应用密码
en: App Passwrod

source: 应该是太冷门了吧，数据库里找不到对应的语言。🥲
en: It’s probably too obscure, that’s why the language can’t be found in the database. 🥲

source: 开启我的年度报告
en: Open My Annual Report

source: 感谢我的仓库们，他们记录着我生活的点点滴滴。
en: Many thanks to our repository, the kept our records.

source: 成就墙
en: Achievements

source: 我不知道你写了什么
en: I’m not sure what you wrote either.

source: 我也不知道你来这里干什么
en: I don’t know why you’ve here.

source: 我从来不摸鱼，因为没有鱼给我摸。🐟
en: I never slack off, because there’s no fish for me to touch. 🐟

source: 我们将会列出你的全部仓库地址供你挑选，稍后克隆到本地为分析作准备。
en: We will list all your repository addresses for you to choose from, and later clone them to your local machine to prepare for analysis.

source: 我会写很多很多的单词，很多很多的句子。
en: I can write many, many words, many, many sentences.

# 我最喜欢在 %@ 的时候提交代码，总共提交了 %lld 次。
source: 我最喜欢在 %1$@ 的时候提交代码，总共提交了 %2$lld 次。
en: I love submitting code when %1$@, and I have made a total of %2$lld commits.

source: 我和我的代码，还有这一年。
en: My code, my journey, and this year.

source: 我很专一，没有使用过其他的语言。
en: I am very dedicated and have never used any other language.

source: 我想你也会很喜欢的，我如此说道，我如此和你说道。
en: I think you will like it too, as I say this, I say it to you.

source: 我是卷王本王 🤪
en: I am the King of Competition! 🤪

source: 我是卷王王中王本王
en: King of Compete

source: 我是奥特曼
en: I’m Altman

source: 我的 Bufeature 做好了吗？
en: Is my Bufeature ready?

source: 我的年度代码总结
en: My Annual Code Summary

source: 我着实不能理解其中的含义。
en: I truly cannot understand the meaning behind it.

source: 打印
en: Print

source: 扫码开启你的专属年度代码提交报告
en: Scan the QR code to unlock your personalized annual code commit report.

source: 排除列表
en: Exclude List

source: 提交的次数为负数
en: Negative Commits

source: 提交记录告诉咱：
en: The commit history tells us:

source: 提交记录里，这些词经常出现
en: These words often appear in the commit history:

source: 数据源
en: Data Source

source: 文件名关键词
en: Filename Keyword

source: 文件名关键词 匹配大小写
en: Filename Keyword & Case Sensitive

source: 文件名正则表达式完整匹配
en: Filename Regex Full Match

source: 文明语言大师
en: Civilized Language Master

source: 文明语言学者
en: Civilized Language Scholar

source: 无名氏
en: Anonymous

source: 早晨
en: Morning

source: 早睡早起身体好
en: Early to bed, early to rise, healthy body.

source: 星星有月亮，代码回家有仓库，而你有我相伴。😛
en: The stars have the moon, code has repositories to return to, and you have me by your side. 😛

source: 星爸爸和气氛组的关怀
en: The coffee shop is necessary

source: 是的，我又在摸鱼 🥺
en: Haha, I see! Sometimes a little break is needed! 😅

source: 晚上
en: Night

source: 晚饭的吃好
en: Dinner the Best

source: 晚餐时间
en: Dinner Time

source: 有 %@ 个周末的日子，我在仓库留下了身影。
en: There are %@ weekends, and I’ve left my mark in the repository.

source: 有一些些提交
en: Committed Some Sometimes

source: 有一些提交
en: Committed Sometimes

source: 有很多很多很多很多的提交
en: Many Many Many Commits

source: 有很多提交
en: Many Commits

source: 未找到有效的仓库。
en: No valid repository found.

source: 本地仓库
en: Local Repository

source: 校验码: 0x%@
en: Checksum: 0x%@

source: 正在从 Bitbucket 下载仓库 %@...
en: Downloading repository %@ from Bitbucket…

source: 正在从 Github 下载仓库 %@...
en: Downloading repository %@ from GitHub…

source: 正在从 GitLab 下载仓库 %@...
en: Downloading repository %@ from GitLab…

source: 正在分析 %@...
en: Analysis %@…

source: 正在创建分析副本 %@...
en: Creating analysis copy %@…

source: 正在处理...
en: Processing…

source: 正在查找代码仓库...
en: Searching for code repositories…

source: 正在生成汇总...
en: Generating Summary…

source: 正在解析数据...
en: Decoding data…

source: 此年度报告支持以下数据源
en: This report supports following data source

source: 没有可用的数据源，分析被取消。
en: No data source available.

source: 没有可用的数据源，请点击上面的按钮来添加。
en: No available data sources. Please click the button above to add.

source: 添加
en: Add

source: 添加来自 Bitbucket 的仓库
en: Add Repository @Bitbucket

source: 添加来自 GitHub 的仓库
en: Add Repository @GitHub

source: 添加来自 GitLab 的仓库
en: Add Repository @GitLab

source: 添加来自本地的仓库
en: Add Repository @localhost

source: 狗急了会跳墙，我急了会骂娘。一天这么多次的提交，肯定是有人被我骂得很惨吧。
en: A cornered dog will jump over a wall, and when I’m pushed, I start swearing. With so many commits in a day, someone must’ve caught the brunt of my wrath, huh?

source: 生成截图
en: Generate Screenshot

source: 用户名
en: Username

source: 由 标准件厂长@砍砍 制作
en: Made by @Lakr233

source: 睡前故事
en: Nightmare Story

source: 确定
en: OK

source: 空行能让我的代码变得好看，我很喜欢。
en: Blank lines make my code look better, and I like it.

source: 签到不是胡闹
en: Sign Up & Wake Up.

source: 编程语言大师
en: Master of Programing Language

source: 编辑
en: Edit

source: 致谢
en: Acknowledgement

source: 若要忽略指定的文件，请在此处填写。 我们将会传入提交文件的相对路径与你的排除项逐一进行匹配。 若有一项满足，则该文件不会被记入。此次提交的其他文件仍会进行统计。
en: If you wish to ignore specific files, please enter them here. We will match the relative path of the submitted files with your exclusions one by one. If any of the exclusions match, the file will not be counted. The other files in this submission will still be included in the statistics.

source: 若要添加提交邮件地址，请在下方的文本框中输入。一次仅能输入一个，且只支持小写字符。 若提交的电子邮件地址不在该列表内，则不会计算此次提交。 我们会为你保存电子邮件地址记录，仅需配置一次即可。 登录到 GitHub 或 GitLab 账号会自动添加账号所属的电子邮件地址。 若有不愿使用的电子邮件地址，请在配置完成仓库以后，再来此处删除。
en: To add a commit email address, please enter it in the text box below. Only one email address can be entered at a time, and it must be in lowercase characters. If the submitted email address is not in the list, the commit will not be counted. We will save the email address record for you, and you only need to configure it once. Logging into your GitHub or GitLab account will automatically add the email address associated with the account. If there is an email address you wish not to use, please come back to delete it after the repository configuration is complete.

source: 若要连接到 Bitbucket，请参考
en: To connect to Bitbucket, please refer to:

source: 若要连接到 GitHub，请参考
en: To connect to GitHub, please refer to:

source: 若要连接到 GitLab，请参考
en: To connect to GitLab, please refer to:

source: 获取数据
en: Fetch Data

source: 语言大师的称号，非你莫属！
en: The title of Language Master is yours and yours alone! 🙌

source: 请为 App 专用密码添加 Account 和 Repositories 的 Read 权限。
en: Please grant the App-specific password Read access to Account and Repositories.

source: 请为令牌添加 read_user, read_api, read_repository 权限，需要服务端支持 v4 api。
en: Please grant the token read_user, read_api, and read_repository permissions, and ensure the server supports the v4 API.

source: 请为令牌添加 repo 和 user 的全部权限。
en: Please grant the token full repo and user permissions.

source: 请选择一个需要分析的仓库的来源，我们将在稍后填写具体信息。
en: Please select the source of the repository to be analyzed. Specific details will be filled in later.

source: 请选择一些文件夹，我们将从中搜索仓库。
en: Please select some folders from which we will search for repositories.

source: 路径中存在文件名
en: Path Keyword

source: 路径中存在文件名 匹配大小写
en: Path Keyword & Case Sensitive

source: 路径关键词
en: Path

source: 路径关键词 匹配大小写
en: Path & Case Sensitive

source: 输入昵称 可选
en: Enter Nickname (Optional）

source: 输入电子邮件地址
en: Enter Email Address

source: 辛苦啦 🥲
en: Thank you for your hard work! 🥲

source: 过滤器
en: Filter

source: 这一天，是忙碌的自己，没吃好，没睡好。
en: This day is the busy version of myself — didn’t eat well, didn’t sleep well.

source: 这一年，咱一共卷了 %@ 天。
en: This year, I’ve been competitive for a total of %@ days.

source: 这一年的周末，我都没有提交代码。
en: I didn’t commit any code on the weekends this year.

source: 这一年里，我总共进行了 %@ 次代码提交。
en: In this year, I made a total of %@ code commits.

source: 这份文档
en: This document

source: 这会删除分析记录。
en: This will delete analysis record.

source: 这是我今年写的空行的数量。空行，没错，就是只有空格或者什么都没有的那一行。
en: This is the number of empty lines I wrote this year. Empty lines, yes, the ones that only have spaces or nothing at all.

source: 这是我最常用的语言。
en: This is the language I use most often.

source: 这是我在代码中最常写到的单词，他出现了 %lld 次。
en: This is the word I most frequently wrote in my code, and it appeared %lld times.

source: 这是我在代码提交记录中最常写到的单词，他出现了 %lld 次。
en: This is the word I most frequently wrote in my commit history, and it appeared %lld times.

source: 这相当于好几百只 🐳🐳🐳🐳🐳🐳 从我身边游过
en: That’s like several hundred 🐳🐳🐳🐳🐳🐳 swimming past me!

source: 选择...
en: Select…

source: 邮件地址
en: Email Address

source: 配置排除项
en: Configure Excludes

source: 配置邮箱地址
en: Configure Commit Email

source: 重新开始
en: Start Over

source: 风雨兼程，目的地是我向往的星辰大海。🥺
en: While the world sleep, we dream about the ocean with star. 🥺

source: 风雨兼程的 Coding 旅途，一天中我最忙碌的时段。
en: Was the busy day. Was the busy hour.

source: 黑客是我的外号，我总能找到属于我的 🚩! 是 🏳️‍⚧️ 还是 🏳️‍🌈 呢？
en: Hacker is my nickname—I always manage to claim my own 🚩! But is it 🏳️‍⚧️ or 🏳️‍🌈? 😉
